ams/src/Documents/_РасчетЗарплаты/_РасчетЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_РасчетЗарплаты</name>
  <registerRecords>InformationRegister._Зарплата</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыПриемаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Водители</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрузчикиВМашина</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопРаботы</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Кладовщики</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектовщики</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обмотчики</name>
    <attributes>
      <name>МестоПогрузки</name>
      <type>
        <types>EnumRef._МестаПогрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/_Зарплата/_Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_Зарплата</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef._Работы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Documents/_РасчетЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Склад = AMS_ВызовСервера.СкладПродукции();
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("01-000001");

	Рез = ПолучитьНачисления();

	Выб = Рез.Выбрать();

	Движения._Зарплата.Записывать = Истина;

	Пока Выб.Следующий() Цикл
		Движение = Движения._Зарплата.Добавить();

		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		Движение.Сотрудник = Выб.Сотрудник;
		Движение.Работа = Выб.Работа;
		Движение.Сумма = Выб.Сумма;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНачисления() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Водители", Водители.Выгрузить( , "Сотрудник,Работа,Сумма"));
	Запрос.УстановитьПараметр("ГрузчикиВМашина", ГрузчикиВМашина.Выгрузить( , "Сотрудник,Работа,Сумма"));
	Запрос.УстановитьПараметр("ДопРаботы", ДопРаботы.Выгрузить( , "Сотрудник,Работа,Сумма"));
	Запрос.УстановитьПараметр("Кладовщики", Кладовщики.Выгрузить( , "Сотрудник,Работа,Сумма"));
	Запрос.УстановитьПараметр("Комплектовщики", Комплектовщики.Выгрузить( , "Сотрудник,Работа,Сумма"));
	Запрос.УстановитьПараметр("Обмотчики", Обмотчики.Выгрузить( , "Сотрудник,Работа,Сумма"));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Сотрудник КАК Сотрудник,
	|	т.Работа КАК Работа,
	|	т.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	&Водители КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Сотрудник КАК Сотрудник,
	|	т.Работа КАК Работа,
	|	т.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	&ГрузчикиВМашина КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Сотрудник КАК Сотрудник,
	|	т.Работа КАК Работа,
	|	т.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт3
	|ИЗ
	|	&ДопРаботы КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Сотрудник КАК Сотрудник,
	|	т.Работа КАК Работа,
	|	т.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт4
	|ИЗ
	|	&Кладовщики КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Сотрудник КАК Сотрудник,
	|	т.Работа КАК Работа,
	|	т.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт5
	|ИЗ
	|	&Комплектовщики КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Сотрудник КАК Сотрудник,
	|	т.Работа КАК Работа,
	|	т.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт6
	|ИЗ
	|	&Обмотчики КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт1.Сотрудник КАК Сотрудник,
	|	вт1.Работа КАК Работа,
	|	вт1.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт7
	|ИЗ
	|	вт1 КАК вт1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт2.Сотрудник,
	|	вт2.Работа,
	|	вт2.Сумма
	|ИЗ
	|	вт2 КАК вт2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт3.Сотрудник,
	|	вт3.Работа,
	|	вт3.Сумма
	|ИЗ
	|	вт3 КАК вт3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт4.Сотрудник,
	|	вт4.Работа,
	|	вт4.Сумма
	|ИЗ
	|	вт4 КАК вт4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Сотрудник,
	|	т.Работа,
	|	т.Сумма
	|ИЗ
	|	вт5 КАК т
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт6.Сотрудник,
	|	вт6.Работа,
	|	вт6.Сумма
	|ИЗ
	|	вт6 КАК вт6
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт7.Сотрудник КАК Сотрудник,
	|	вт7.Работа КАК Работа,
	|	СУММА(вт7.Сумма) КАК Сумма
	|ПОМЕСТИТЬ вт8
	|ИЗ
	|	вт7 КАК вт7
	|
	|СГРУППИРОВАТЬ ПО
	|	вт7.Сотрудник,
	|	вт7.Работа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт8.Сотрудник КАК Сотрудник,
	|	вт8.Работа КАК Работа,
	|	вт8.Сумма КАК Сумма
	|ИЗ
	|	вт8 КАК вт8
	|ГДЕ
	|	вт8.Сумма > 0";

	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#КонецЕсли
